Case_0/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (0 0 0)
    (30 0 0)
    (30 1 0)
    (0 1 0)
    (0 0 15)
    (30 0 15)
    (30 1 15)
    (0 1 15));

blocks
(
    hex (0 1 2 3 4 5 6 7) (200 1 40) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
);

mergePatchPairs
(
);


// ************************************************************************* //
